### یخورده پیش در انگیلیسی چی میشه مهممم؟
	- ما کلمه ای داریم به اسمه just در انگلیسی که معنی فقط میده اما اگر 
	- ### بررسی کاربرد و معنی کلمه **Just**:
	
	کلمه **just** در زبان انگلیسی معانی متعددی دارد:
	
	1. **معنی «فقط / صرفاً / تنها» (Only):**
	    
	    - _I just want a cup of water._ (من فقط یک لیوان آب می‌خواهم.)
	    - _It’s just a game._ (این فقط یک بازیه.)
	2. **معنی «همین چند لحظه پیش / یک خرده پیش» (A short time ago):**
	    
	    اگر **just** را در گذشته ساده (Past Simple) بین **فاعل (Subject)** و **فعل گذشته (Past Verb)** قرار دهید، معنی «همین الان / همین چند لحظه پیش / یک خرده پیش» می‌دهد:
	    
	    - **ساختار:**
	    ```
	    Subject+just+past verb+...
	    ```
	
	| english ex                       | to fa                                 |
	| -------------------------------- | ------------------------------------- |
	| I just saw him                   | من یخورده پیش دیدمش                   |
	| She just called me               | اون یخورده پیش بهم زنگ زد             |
	| They just left.                  | اونها یخورده پیش رفتند                |
	| The train just arrived           | قطار یخورده پیش رسید                  |
	| Is Tom here?No, He just left.    | تام اینجاست؟نه اون یخورده پیش رفت     |
	| I'm not hungry.I just had dinner | من گشنم نیست. من یخورده پیش شام خوردم |

